<!DOCTYPE html>
<html lang="en"><!--
 __  __                __                                     __
/\ \/\ \              /\ \             __                    /\ \
\ \ \_\ \   __  __    \_\ \      __   /\_\      __       ___ \ \ \/'\
 \ \  _  \ /\ \/\ \   /'_` \   /'__`\ \/\ \   /'__`\    /'___\\ \ , <
  \ \ \ \ \\ \ \_\ \ /\ \L\ \ /\  __/  \ \ \ /\ \L\.\_ /\ \__/ \ \ \\`\
   \ \_\ \_\\/`____ \\ \___,_\\ \____\ _\ \ \\ \__/.\_\\ \____\ \ \_\ \_\
    \/_/\/_/ `/___/> \\/__,_ / \/____//\ \_\ \\/__/\/_/ \/____/  \/_/\/_/
                /\___/                \ \____/
                \/__/                  \/___/

Powered by Hydejack v8.4.0 <https://hydejack.com/>
-->











<head>
  



<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<meta http-equiv="x-ua-compatible" content="ie=edge">




  
<!-- Begin Jekyll SEO tag v2.3.0 -->
<title>typeof(TSecret) - the secret magic behind .NET generics | yizhang82’s blog</title>
<meta property="og:title" content="typeof(TSecret) - the secret magic behind .NET generics" />
<meta name="author" content="Yi Zhang" />
<meta property="og:locale" content="en" />
<meta name="description" content="How typeof(T) works in .NET generics" />
<meta property="og:description" content="How typeof(T) works in .NET generics" />
<link rel="canonical" href="http://localhost:4000/dotnet-generics-typeof-t" />

            <span class="n">Console</span><span class="p">.</span><span class="nf">WriteLine</span><span class="p">(</span><span class="k">typeof</span><span class="p">(</span><span class="n">T</span><span class="p">));</span>
        <span class="p">}</span>
    <span class="p">}</span>

</code></pre></div></div>

<p>Let’s take look at case #1 first. As discussed earlier, the type parameter is infered from <code class="highlighter-rouge">this</code> pointer. You can see the following code generated by JIT below for the typeof(T) code, with comments added by me.</p>

<pre><code class="language-asm">
00007fff`04ff0946 488b4d10        mov     rcx,qword ptr [rbp+10h]           ; this pointer saved in [rbp+10h] earlier
00007fff`04ff094a 488b09          mov     rcx,qword ptr [rcx]               ; MethodTable *
00007fff`04ff094d 488b4930        mov     rcx,qword ptr [rcx+30h]           ; m_pPerInstInfo at 0x30 offset
00007fff`04ff0951 488b09          mov     rcx,qword ptr [rcx]               ; first generic dictionary
00007fff`04ff0954 488b09          mov     rcx,qword ptr [rcx]               ; first type arg
00007fff`04ff0957 48894de0        mov     qword ptr [rbp-20h],rcx
00007fff`04ff095b 8b4de0          mov     ecx,dword ptr [rbp-20h]
00007fff`04ff095e f7c101000000    test    ecx,1                             ; does it have indirection?
00007fff`04ff0964 750a            jne     00007fff`04ff0970
00007fff`04ff0966 488b4de0        mov     rcx,qword ptr [rbp-20h]           ; no indirection required - load T
00007fff`04ff096a 48894dd8        mov     qword ptr [rbp-28h],rcx
00007fff`04ff096e eb0f            jmp     00007fff`04ff097f
00007fff`04ff0970 488b4de0        mov     rcx,qword ptr [rbp-20h]           ; has indirection - go get that
00007fff`04ff0974 488b89ffffffff  mov     rcx,qword ptr [rcx-1]
00007fff`04ff097b 48894dd8        mov     qword ptr [rbp-28h],rcx
00007fff`04ff097f 488b4dd8        mov     rcx,qword ptr [rbp-28h]           ; either way rbp-28h is the MethodTable * we need
00007fff`04ff0983 e868dfac5f      call    coreclr!JIT_GetRuntimeType (00007fff`64abe8f0)    ; Get Type object

</code></pre>

<p>Before we dive deeper, we need to talk about another concept - generic dictionaries.</p>

<p>You might have realized this in the beginning of this article - if we use <code class="highlighter-rouge">this</code> pointer to get the type argument, we need a way to say “give me the T argument”. The runtime supports this operation using a special data structure called generic dictionary in <code class="highlighter-rouge">MethodTable</code> (see my earlier description for MetohdTable and MethodDesc). It saves each type argument for each generic parameter, and also caches associated instantiations (we won’t talk about it here - otherwise this will get too long). It is in <code class="highlighter-rouge">m_pPerInstInfo</code> field which happens to be at 0x30:</p>

<div class="highlighter-rouge"><div class="highlight"><pre class="highlight"><code>
0:000&gt; dt coreclr!MethodTable
   =00007fff`64ec6808 s_pMethodDataCache : (null) 
   =00007fff`64ebe154 s_fUseParentMethodData : Int4B
   =00007fff`64ebe158 s_fUseMethodDataCache : Int4B
   +0x000 m_dwFlags        : Uint4B
   +0x004 m_BaseSize       : Uint4B
   +0x008 m_wFlags2        : Uint2B
   +0x00a m_wToken         : Uint2B
   +0x00c m_wNumVirtuals   : Uint2B
   +0x00e m_wNumInterfaces : Uint2B
   +0x010 m_pParentMethodTable : Uint8B
   +0x018 m_pLoaderModule  : Ptr64 Module
   +0x020 m_pWriteableData : Ptr64 MethodTableWriteableData
   +0x028 m_pEEClass       : Ptr64 EEClass
   +0x028 m_pCanonMT       : Uint8B
   +0x030 m_pPerInstInfo   : Ptr64 Ptr64 Dictionary

</code></pre></div></div>

<p>The <code class="highlighter-rouge">MethodTable</code> pointer is always at the first pointer field in any object - this is how you can do <code class="highlighter-rouge">object.GetType</code> for any reference type - just get the first pointer field and you got the MethodTable *. You can think of this as .NET / CLR’s equivalent of C++ vtable / RTTI, but with much richer information. Anyway, it is only a few pointers away between the object and the <code class="highlighter-rouge">m_pPerInstInfo</code>:</p>

<pre><code class="language-asm">
00007fff`04ff0946 488b4d10        mov     rcx,qword ptr [rbp+10h]           ; this pointer
00007fff`04ff094a 488b09          mov     rcx,qword ptr [rcx]               ; MethodTable *
00007fff`04ff094d 488b4930        mov     rcx,qword ptr [rcx+30h]           ; m_pPerInstInfo

</code></pre>

