<?xml version="1.0" encoding="utf-8"?><feed xmlns="http://www.w3.org/2005/Atom" xml:lang="en"><generator uri="https://jekyllrb.com/" version="3.6.2">Jekyll</generator><link href="http://localhost:4000/feed.xml" rel="self" type="application/atom+xml" /><link href="http://localhost:4000/" rel="alternate" type="text/html" hreflang="en" /><updated>2019-05-06T10:22:33-07:00</updated><id>http://localhost:4000/</id><title type="html">yizhang82’s blog</title><subtitle>Languages, Runtime, Data structures, Databases, and everything in between
</subtitle><author><name>Yi Zhang</name><email>mail@yizhang82.me</email></author><entry><title type="html">Repeatable reads in InnoDB comes with a catch</title><link href="http://localhost:4000/innodb-repeatable-read" rel="alternate" type="text/html" title="Repeatable reads in InnoDB comes with a catch" /><published>2019-05-05T00:00:00-07:00</published><updated>2019-05-05T00:00:00-07:00</updated><id>http://localhost:4000/innodb-repeatable-reads</id><content type="html" xml:base="http://localhost:4000/innodb-repeatable-read">&lt;p&gt;A few days ago I was looking into a deadlock issue that is caused by a behavioral difference between MySQL storage engine transaction behavior in repeatable reads. This leads me to dig deeper into repeatable read behavior in InnoDB and what I found is quite interesting:&lt;/p&gt;

&lt;h2 id=&quot;the-basics&quot;&gt;The basics&lt;/h2&gt;


&lt;p&gt;Let’s take look at case #1 first. As discussed earlier, the type parameter is infered from &lt;code class=&quot;highlighter-rouge&quot;&gt;this&lt;/code&gt; pointer. You can see the following code generated by JIT below for the typeof(T) code, with comments added by me.&lt;/p&gt;

&lt;pre&gt;&lt;code class=&quot;language-asm&quot;&gt;
00007fff`04ff0946 488b4d10        mov     rcx,qword ptr [rbp+10h]           ; this pointer saved in [rbp+10h] earlier
00007fff`04ff094a 488b09          mov     rcx,qword ptr [rcx]               ; MethodTable *
00007fff`04ff094d 488b4930        mov     rcx,qword ptr [rcx+30h]           ; m_pPerInstInfo at 0x30 offset
00007fff`04ff0951 488b09          mov     rcx,qword ptr [rcx]               ; first generic dictionary
00007fff`04ff0954 488b09          mov     rcx,qword ptr [rcx]               ; first type arg
00007fff`04ff0957 48894de0        mov     qword ptr [rbp-20h],rcx
00007fff`04ff095b 8b4de0          mov     ecx,dword ptr [rbp-20h]
00007fff`04ff095e f7c101000000    test    ecx,1                             ; does it have indirection?
00007fff`04ff0964 750a            jne     00007fff`04ff0970
00007fff`04ff0966 488b4de0        mov     rcx,qword ptr [rbp-20h]           ; no indirection required - load T
00007fff`04ff096a 48894dd8        mov     qword ptr [rbp-28h],rcx
00007fff`04ff096e eb0f            jmp     00007fff`04ff097f
00007fff`04ff0970 488b4de0        mov     rcx,qword ptr [rbp-20h]           ; has indirection - go get that
00007fff`04ff0974 488b89ffffffff  mov     rcx,qword ptr [rcx-1]
00007fff`04ff097b 48894dd8        mov     qword ptr [rbp-28h],rcx
00007fff`04ff097f 488b4dd8        mov     rcx,qword ptr [rbp-28h]           ; either way rbp-28h is the MethodTable * we need
00007fff`04ff0983 e868dfac5f      call    coreclr!JIT_GetRuntimeType (00007fff`64abe8f0)    ; Get Type object

&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;Before we dive deeper, we need to talk about another concept - generic dictionaries.&lt;/p&gt;

&lt;p&gt;You might have realized this in the beginning of this article - if we use &lt;code class=&quot;highlighter-rouge&quot;&gt;this&lt;/code&gt; pointer to get the type argument, we need a way to say “give me the T argument”. The runtime supports this operation using a special data structure called generic dictionary in &lt;code class=&quot;highlighter-rouge&quot;&gt;MethodTable&lt;/code&gt; (see my earlier description for MetohdTable and MethodDesc). It saves each type argument for each generic parameter, and also caches associated instantiations (we won’t talk about it here - otherwise this will get too long). It is in &lt;code class=&quot;highlighter-rouge&quot;&gt;m_pPerInstInfo&lt;/code&gt; field which happens to be at 0x30:&lt;/p&gt;

&lt;div class=&quot;highlighter-rouge&quot;&gt;&lt;div class=&quot;highlight&quot;&gt;&lt;pre class=&quot;highlight&quot;&gt;&lt;code&gt;
0:000&amp;gt; dt coreclr!MethodTable
   =00007fff`64ec6808 s_pMethodDataCache : (null) 
   =00007fff`64ebe154 s_fUseParentMethodData : Int4B
   =00007fff`64ebe158 s_fUseMethodDataCache : Int4B
   +0x000 m_dwFlags        : Uint4B
   +0x004 m_BaseSize       : Uint4B
   +0x008 m_wFlags2        : Uint2B
   +0x00a m_wToken         : Uint2B
   +0x00c m_wNumVirtuals   : Uint2B
   +0x00e m_wNumInterfaces : Uint2B
   +0x010 m_pParentMethodTable : Uint8B
   +0x018 m_pLoaderModule  : Ptr64 Module
   +0x020 m_pWriteableData : Ptr64 MethodTableWriteableData
   +0x028 m_pEEClass       : Ptr64 EEClass
   +0x028 m_pCanonMT       : Uint8B
   +0x030 m_pPerInstInfo   : Ptr64 Ptr64 Dictionary

&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;

&lt;p&gt;The &lt;code class=&quot;highlighter-rouge&quot;&gt;MethodTable&lt;/code&gt; pointer is always at the first pointer field in any object - this is how you can do &lt;code class=&quot;highlighter-rouge&quot;&gt;object.GetType&lt;/code&gt; for any reference type - just get the first pointer field and you got the MethodTable *. You can think of this as .NET / CLR’s equivalent of C++ vtable / RTTI, but with much richer information. Anyway, it is only a few pointers away between the object and the &lt;code class=&quot;highlighter-rouge&quot;&gt;m_pPerInstInfo&lt;/code&gt;:&lt;/p&gt;

&lt;pre&gt;&lt;code class=&quot;language-asm&quot;&gt;
00007fff`04ff0946 488b4d10        mov     rcx,qword ptr [rbp+10h]           ; this pointer
00007fff`04ff094a 488b09          mov     rcx,qword ptr [rcx]               ; MethodTable *
